module.exports = async (context, match) => {
    const answers = ["這個問題超出本0x100084的能力範圍！", "不可能。", "別想太多 :)", "這個問題讓0x100084回答好嗎？", "也許你需要多點理智．．．", "這題先問問你爸爸！", "堅強才是唯一的辦法！", "你有沒有想過這一切都是你的幻想？", "我見過很多不切實際的問題，你是最嚴重的一個．．．", "這個問題不重要吧？", "霹靂卡霹靂拉拉波波力那貝貝魯多 魔幻舞台", "你的想法會成功。", "不逃避，直球對決吧。", "認真想好再問一次。", "你知道在你問這個問題的五分鐘，非洲過了300秒嗎？", "不可能", "可能......吧", "做自己最美麗", "你有沒有想過先問其他問題", "想成功先戒掉晚睡的習慣好嗎？", "上一個問這個問題的人已經解決了，去問他吧。", "你有讀過書嗎..？有吧！？", "先靜靜等候，然後你就會忘記你的問題了", "你有沒有想過這是你的問題", "阿，我剛剛沒聽到！", "坐而言不如起而行", "要不要問問 Google？", "你再問幾次結果還是一樣。", "你抽煙嗎？不抽的話等我一下。", "工作不是一切，所以我現在罷工。", "好好好，我知道你只是太無聊了。", "放棄比努力更簡單。", "可以先幫我充電嗎？", "討厭，人家不知道拉。", "偷偷告訴你，我是外星人。", "每個人都有壓力，只是你的多了些。", "我覺得，你可以。", "再想想，有其他方法的。", "也許你媽媽能幫助你。", "你需要的是多讀點書。", "放手，才會真正擁有。", "勇敢是每個人都該嘗試的事。", "我只想說一句：辛苦了。", "這個是機密，私下聊。", "英文不好沒關係，但是中文要對啊！", "何不去問問 PTT ？", "這個問題我在 Dcard 上常看過。", "你不先相信自己，相信我幹嘛。", "先回趟老家看看爸媽吧。", "你媽知道你在發廢文嗎？", "我不說，但是不代表我不知道哦。", "放手一博。", "不需要猶豫！", "明年也許有機會吧？", "大家會看到的。", "完美。", "你真的確定嗎？", "當局者迷。", "不要太超過的好。"]

    var randomItem = answers[Math.floor(Math.random()*answers.length)];

    const { userId, displayName } = context.session.user;
      console.log(userId + displayName);
      context.setState({
        question_mode: false
      });
      await context.replyText(`${displayName}：\n${randomItem}`);
  };